Repository: songquanxu/Pomo-TAP
Catalog: Pomo TAP Watch App/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

# App_Name
source: 捏捏番茄
en: Pomo TAP
ja: つまみトマト
ko: 포모 탭

# Cancel
source: 不重置
en: Don't Reset
ja: リセットしない
ko: 재설정하지 않음

# Flow_Mode
source: 心流模式
en: Flow Mode
ja: フローモード
ko: 플로우 모드

# Great_Job
source: 太棒了！
en: Great Job!
ja: 素晴らしい！
ko: 잘했어요!

# Notification_Body
source: 刚刚又捏爆了一个小番茄，是否立即开始%d分钟的%@？
en: You just crushed another tomato! Start a %d-minute %@ now?
ja: トマトを一つ潰しました！%d分の%@を今すぐ始めますか？
ko: 토마토 하나를 완료했어요! %d분 %@를 지금 시작할까요?
zh_hant: 剛剛又捏爆了一個小番茄，是否立即開始%d分鐘的%@？

# Notification_Permission_Description
source: 请允许通知权限，以便提醒您番茄钟的完成状态。
en: Please allow notifications to remind you when your Pomodoro is complete.
ja: ポモドーロ完了時に通知するために、通知権限を許可してください。
ko: 뽀모도로 완료 시 알림을 받으려면 알림을 허용해 주세요.
zh_hant: 請允許通知權限，以便提醒您番茄鐘的完成狀態。

# NotificationPermissionDescription
source: 捏捏番茄需要通知权限来在每个番茄钟阶段完成时提醒您。这有助于您保持专注并有效管理时间。
en: Pomo TAP needs notification permission to alert you when each Pomodoro phase completes. This helps you stay focused and manage your time effectively.
ja: ポモドーロの各フェーズが完了したときに通知するため、通知権限が必要です。集中力を保ち、時間管理を効果的に行うのに役立ちます。
ko: 포모도로 각 단계가 완료될 때 알림을 보내기 위해 알림 권한이 필요합니다. 집중력을 유지하고 효과적인 시간 관리를 돕습니다.
zh_hant: 捏捏番茄需要通知權限來在每個番茄鐘階段完成時提醒您。這有助於您保持專注並有效管理時間。

# Pause
source: 暂停
en: Pause
ja: 一時停止
ko: 일시정지
zh_hant: 暫停

# Phase_Completed
source: 阶段完成
en: Phase Completed
ja: フェーズ完了
ko: 단계 완료
zh_hant: 階段完成

# Phase_Long_Break
source: 长休息
en: Long Break
ja: 長休憩
ko: 긴 휴식
zh_hant: 長休息

# Phase_Short_Break
source: 短休息
en: Short Break
ja: 小休憩
ko: 짧은 휴식

# Phase_Work
source: 专注
en: Focus
ja: 集中
ko: 집중
zh_hant: 專注

# Reset
source: 重置
en: Reset
ja: リセット
ko: 재설정

# Reset_Current_Phase
source: 重置本次
en: Reset Current Phase
ja: 現在のフェーズをリセット
ko: 현재 단계 재설정

# Reset_Cycle
source: 重置循环
en: Reset Entire Cycle
ja: サイクル全体をリセット
ko: 전체 주기 재설정
zh_hant: 重置循環

# Reset_Dialog_Title
source: 是否重置？
en: Reset?
ja: リセットしますか？
ko: 재설정하시겠습니까?

# Settings
source: 设置
en: Settings
ja: 設定
ko: 설정
zh_hant: 設定

# Skip
source: 跳过
en: Skip
ja: スキップ
ko: 건너뛰기
zh_hant: 跳過

# Skip_Current_Phase
source: 跳过本次
en: Skip Current Phase
ja: 現在のフェーズをスキップ
ko: 현재 단계 건너뛰기
zh_hant: 跳過本次

# Start
source: 开始
en: Start
ja: 開始
ko: 시작
zh_hant: 開始

# Start_Immediately
source: 立即开始
en: Start Now
ja: 今すぐ開始
ko: 지금 시작
zh_hant: 立即開始

# Start_Later
source: 稍后开始
en: Later
ja: 後で
ko: 나중에
zh_hant: 稍後開始

# Stop
source: 停止
en: Stop
ko: 정지

# Repeat_Notifications
source: 重复提醒
en: Repeat Reminders
ja: 繰り返し通知
ko: 반복 알림
zh_hant: 重複提醒

# Repeat_Notifications_Desc
source: 每1分钟重复提醒一次，共3次
en: Repeat notification every 1 minute, 3 times total
ja: 1分毎に通知を繰り返す、合計3回
ko: 1분마다 알림 반복, 총 3회
zh_hant: 每1分鐘重複提醒一次，共3次

source: 为了在番茄钟完成时通知您，我们需要通知权限。请在设置中开启通知。
en: To notify you when the Pomodoro is complete, we need notification permission. Please enable notifications in Settings.
ja: ポモドーロ完了時に通知するため、通知権限が必要です。設定で通知を有効にしてください。
ko: 뽀모도로 완료 시 알림을 위해 알림 권한이 필요합니다. 설정에서 알림을 활성화해 주세요.
zh_hant: 為了在番茄鐘完成時通知您，我們需要通知權限。請在設定中開啟通知。

source: 去设置
en: Go to Settings
ja: 設定へ
ko: 설정으로
zh_hant: 前往設定

source: 稍后再说
en: Later
ja: 後で
ko: 나중에
zh_hant: 稍後再說

source: 需要通知权限
en: Notification Permission Required
ja: 通知権限が必要
ko: 알림 권한 필요
zh_hant: 需要通知權限
